# age = int(input("Введіть ваш вік: "))
#
# print("Через 5 років вам буде: ", age+5)

# print(int(100.99)) # 100 - заокруглює в меншу сторону
#
# print(int(True)) # 1
# print(int(False)) # 0

# num = 123
# print("Число: " + str(num))

# i = 100.99
# i = int(i)

# height = float(input("Введіть ваш ріст (в м): "))
# age = int(input("Введіть ваш вік: "))

# if age >= 18 and height >= 1.6:
#     print("Вам дозволений вхід")
# elif age >= 15 or height >= 1.7:
#     print("Вхід дозволений лише з батьками")
# else:
#     print("Вхід заборонено")

# Це 1 повне розгалуження - в результаті виведеться лише 1 значення

# if age >= 30:
#     print("Ви дорослий")
# elif age >= 18:
#     print("Ви повнолітній")
# elif age >= 15:
#     print("Ви підліток")
# else:
#     print("Ви дитина")

# Це 3 різних розгалуженя, тобто може відпрацювати до 3 блоків коду

# if age >= 30:
#     print("Ви дорослий")
# if age >= 18:
#     print("Ви повнолітній")
# if age >= 15:
#     print("Ви підліток")
# else:
#     print("Ви дитина")

# Це 1 розгалуження, йде в зворотньому напрямку з протилежним порівнюванням

# if age <= 10:
#     print("Ви дитина")
# elif age <= 15:
#     print("Ви підліток")
# elif age <= 18:
#     print("Ви повнолітній")
# else:
#     print("Ви дорослий")


# is_adult = "Ви повнолітній" if age > 18 else "Ви піділток"
# print(is_adult)